primer = {
    1: '',
    2: '',
    3: '',
    4: '',
    5: '',
    6: '',
    7: '',
    8: '',
    9: '',
    10: '',
    11: '',
    12: '',
    13: '',
    14: '',
    15: '',
    16: '',
    17: '',
    18: '',
    19: '',
    20: '',
    21: '',
    22: '',
}


portretLichnostiEnergy = {
    1: 'One Piece (яп. ワンピース ван пи:су, «Ван-Пис») — сёнэн-манга за авторством Эйитиро Оды, выходящая с 19 июля 1997 года по настоящее время в журнале Weekly Shonen Jump. Объединена в 103 танкобона. One Piece повествует о приключениях пиратской команды названием «Пираты Соломенной шляпы» во главе с капитаном Манки Д. Луффи (яп. モンキー・Ⅾ・ルフィ), в детстве съевшим Дьявольский плод Резина-Резина (яп. ゴムゴムの実 гому гому но ми), давший ему способность растягиваться и сжиматься, как резина. Вместе со своей командой Луффи ищет легендарное сокровище, известное как «Ван-Пис», чтобы стать королём пиратов.',
    2: 'В формате тома манга впервые увидела свет 24 декабря 1997 года. В аниме-адаптацию входят телесериал, четырнадцать полнометражных фильмов и несколько OVA. Впервые One Piece вышел на экраны в формате OVA в 1998 году, премьера первой серии аниме-сериала состоялась 20 октября 1999 года. Кроме того, под маркой One Piece выпущено около трёх десятков игр для различных игровых консолей. В России и манга, и аниме лицензированы издательством «Комикс-Арт» под названием «One Piece. Большой куш»[1][~ 1], премьера сериала в России состоялась 16 апреля 2012 года на телеканале 2x2[2].В 2019 году издательство Азбука-Аттикус объявило о переиздании манги в России.',
    3: 'Манга входит в число наиболее успешных изданий компании Shueisha за всю историю[3]. С момента своего выпуска One Piece стал самой популярной мангой в Японии и одной из наиболее популярных манг по всему миру[4]. На момент выхода 67-го тома, первый тираж которого составил 4 050 000 экземпляров — самый большой первый тираж манги в Японии и в мире[5]. В 2021 году стало известно, что суммарные продажи томов One Piece превысили 490 миллионов экземпляров, став вторым по продаваемости комиксом в мире, обойдя Бэтмена и уступая лишь Супермену[6]. One Piece является самой',
    4: 'Маунтин добраться до вершины горы, а потом спуститься с горы по пятому течению, ведущему прямиком на Гранд-Лайн[10]. Гранд-Лайн отличается непредсказуемым климатом. Из-за разницы климатических зон на этом течении существует четыре основных типа островов по климатическим условиям: летние, весенние, осенние и зимние[11]. Так как на Гранд-Лайн полно магнитных аномалий, обычный компас непригоден для навигации по этому течению. Для этого существует специальный компас лог-пос, который при пребывании в течение некоторого времени на одном из островов Гранд-Лайн настраивается на магнитное поле следующего[12]. Вторая половина Гранд-Лайн, начинающаяся после пересечения его с Ред-Лайн, называется «Новым светом» и отличается более суровым климатом, чем первая половина. Те, кто побывал в Новом',
    5: 'Дьявольский плод (яп. 悪魔の実: Akuma no Mi) — это плод, дающий съевшему его какую-либо сверхъестественную способность[20]. Их называют «сокровищем моря» и считают «воплощением морского дьявола». Формы и расцветки Дьявольских плодов многообразны, но на любом плоде присутствует характерный узор из завитков, который с первого взгляда позволяет отличить их от обычных плодов[17]. У каждого Дьявольского плода есть своя собственная уникальная способность, и каждый вид существует в единичном экземпляре. Дьявольские плоды считаются редкостью и высоко ценятся: даже плоды, эффект которых неизвестен, оцениваются не менее, чем в 100,000,000 белли[21]. По словам Эйитиро Оды, всего их существует более сотни[22]. На вкус плоды противны, но, чтобы получить их способность, необязательно есть плод целиком, однако, если один кусок плода был съеден, остальная его часть теряет свою силу. Один человек может съесть только один плод, попытка съесть второй плод приведёт к смерти. После смерти владельца плод возникает снова, и его мо',
    6: 'ный тип», который считается наиболее редким и мощным типом Дьявольских плодов. Позволяет своему обладателю превращать своё тело в какую-либо стихию или вещество, к примеру, в огонь, песок или молнию, и управлять ими, за счёт чего съевшие такой плод почти неуязвимы. Тем не менее, у многих Логий есть свои слабые места, например, молния нейтрализуется резиной, а песок нейтрализуется водой.',
    7: 'Сору (яп. 剃 Сору, Брить) — техника, позволяющая двигаться с очень высокой скоростью.',
    8: 'Продвигаясь дальше, Луффи знакомится с пиратом Маршаллом Д. Тичем, который, как и Луффи, мечтает стать Королём пиратов. Затем Луффи с друзьями отправляются на небесный остров Скайпия, на котором идёт война между двумя народами: скайпийцами и шандийцами. Друзья оказываются втянуты в эту войну, что приводит к их конфликту с правителем острова, «богом» Энелем. Луффи побеждает Энеля, тем самым спасая Скайпию и положив конец войне. Вскоре после приключений на острове Скайпия команда сталкивается с адмиралом дозорных Аокидзи, который рассказывает команде, что знания Робин о понеглифах не выгодны Мировому правительству: в надписях на понеглифах содержатся доказательства о том, что Мировое правительство пришло к власти сомнительным путём. Некогда существовало двадцать королевств, уничтоживших древнее королевство, и позже, во времена Пустого века, историю которого запрещено изучать, они объединились в Мировое правительство. Понеглифы — всё, что осталось от древнего королевства. Луффи отказывается выдавать её Мировому правительству и пытается сразиться с Аокидзи, но тот оказывается слишком силён, и Пиратам Соломенной шляпы приходится спасаться бегством. Команда доплывает до судостроительной верфи Уотер-Севен, где они вступают в конфликт с бандой киборга Фрэнки. Однако неожиданно тайная полиция Мирового правительства CP-9, самым сильным из членов которой является агент Роб Луччи, захватывает Робин в плен и везёт её в цитадель на острове Эниес-Лобби. Пираты Соломенной шляпы, желая спасти Робин, объявляют войну Мировому правительству. В результате долгих битв с CP-9 друзья спасают Робин, а впоследствии к ним присоединяется Фрэнки в качестве корабельного плотника. В процессе полностью уничтожен корабль «Гоинг Мерри», однако Фрэнки строит корабль «Таузенд Санни», намного превосходящий «Гоинг Мерри», который и становится кораблём Пиратов Соломенной шляпы.',
    9: 'ию и возвращают тень скелету по имени Брук, который отныне становится музыкантом в их команде. Пираты почти добираются до Ред-Лайн, соответственно, пройдя первую половину Гранд-Лайн. В Новый свет из первой половины Гранд-Лайн можно попасть, только проплыв под континентом Ред-Лайн, чтобы это сделать, корабль требуется покрыть пузырём из специальной смолы, который можно добыть на архипелаге Сабаоди. На Сабаоди герои знакомятся с Сильверсом Рейли, бывшим первым помощником в команде Гол Д. Роджера. Рейли рассказывает, что Роджер сам сдался дозорным, поскольку был неизлечимо болен ещё за три года до своей казни, и умер бы в любом случае. Выясняется, что среди четырёх сильнейших пиратов, правящих Новым светом, «Императоров морей», также есть Шанкс, который когда-то вдохновил Луффи ',
}


//=======================================================================================





const portretLichnostiBtn = document.getElementById("portretLichnostiBtn")

const portretLichnosti = document.getElementById("portretLichnosti")









function getEnergy(EnrgyList, EnergyDiv, numbers, title){
    const hash = document.createElement('h2')
    hash.innerText = title
    EnergyDiv.append(hash)

    numbers.forEach(element => {
        const pesehechka = document.createElement('p')
        pesehechka.setAttribute('contenteditable', 'true');
        pesehechka.innerText = EnrgyList[element]
        EnergyDiv.append(pesehechka)
    });
}


portretLichnostiBtn.addEventListener('click', () => {
    getEnergy(portretLichnostiEnergy, portretLichnosti, [parseInt(p01.innerText), parseInt(p21.innerText), parseInt(pCenter.innerText)], "Портрет особистості")
})